SuperTapir/CadenzaOS/hardware/cadenza/validation/l2-input-firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=n

# Candidate defaults. Both encoder values can also be changed at runtime.
CONFIG_L2_ENCODER_COUNTS_PER_DETENT=4
# CONFIG_L2_ENCODER_REVERSE is not set
CONFIG_L2_BUTTON_DEBOUNCE_MS=20
CONFIG_L2_BUTTON_LONG_PRESS_MS=800
CONFIG_L2_STATUS_PERIOD_MS=1000
# CONFIG_L2_EVENT_LOGGING is not set
